*** Scheme Is Fancier!

Remember our general advice:
- Don't write macros unless there's going to be a big payoff!
- There's almost never a need for more macros!

So you almost certainly don't need to know any of this stuff. But in the rare
case you need it, or the much more likely case that you're simply perversely
interested, here's an executive overview!

Scheme Family Lisps (such as Racket) use a special data type called a [[https://docs.racket-lang.org/guide/stx-obj.html][Syntax
Object]] to represent forms for Macro Expansion. [[https://beautifulracket.com/explainer/syntax-objects.html][Syntax Objects]] enclose the
Symbolic-Expression of the Form along with additional information that could
inform the macro transformation procedure how to do a better job. Syntax Objects
allow macro transformation to be more nuanced. But they could also make it
harder to write such transformers.

For convenience, Scheme Family Lisps provide at least two ways to define a macro
transformer
- (define-syntax-rules pattern template) :: using pattern matching
- (define-syntax name procedure) :: using an arbitrary procedure

Most macros can be defined with [[https://docs.racket-lang.org/guide/pattern-macros.html][Pattern-Based Macros]]
#+begin_src racket :results output
  #lang racket
  ;; define a racket which swaps the values of two variables
  (define-syntax-rule (swap x y)
    (let ([tmp x])
      (set! x y)
      (set! y tmp) ) )
  ;; use it like this
  (define a 'hello)
  (define b 'goodbye)
  (swap a b)
  (displayln a) ; prints 'goodbye
  (displayln b) ; prints 'hello
#+end_src

#+RESULTS:
: goodbye
: hello

But if we learned the fancier system, we could provide additional features, e.g. error checking and reporting
#+begin_src racket
  #lang racket
  (define-syntax (swap stx)
    (syntax-case stx ()
      [(swap x y)
       (if (and (identifier? #'x)
                (identifier? #'y))
           #'(let ([tmp x])
               (set! x y)
               (set! y tmp))
           (raise-syntax-error #f
                               "not an identifier"
                               stx
                               (if (identifier? #'x)
                                   #'y
                                   #'x)))]))
#+end_src


There are convenience functions such as
- ~syntax-case~ :: does pattern matching against a syntax object
- ~raise-syntax-error~ :: extracts location information from a syntax object to
  produce a more useful error message

Hey, you said I won't ever need to write any macros, but I want to be able to do
things like swapping variables without having to create stupid temporary
variables.

Okay, no macros are needed:
#+begin_src racket :results output
  #lang racket
  (define a 'hello)
  (define b 'goodbye)
  (set!-values (b a) (values a b))
  (displayln a) ; prints 'goodbye
  (displayln b) ; prints 'hello
#+end_src

#+RESULTS:
: goodbye
: hello

Compared to our ~swap~ macro
- this is more efficient
- and can be adapted to other situations
      - more than two values
      - values coming from arbitrary sources
      - see also ~define-values~

Macros, schmacros!

